app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE "events"."id" = 3 LIMIT 1
---
  def show
    @event = Event.find_by_id(params[:id])

SELECT "events".* FROM "events" ORDER BY "events"."id" DESC LIMIT 1
---
  def current_event
  	@event = Event.last