app/controllers/users_controller.rb

  def show

    @user = User.find_by_id(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1